{"data":{"allMarkdownRemark":{"edges":[{"node":{"frontmatter":{"title":"Achtung Panzer","tech":["Python","PyGame"],"github":"https://github.com/Greenheart/AchtungPanzer","demo":null,"year":"2015"},"html":"<p>An intense 2D tank battle for two players on the same computer. Including two different ammo-types (long-range/low damage main cannon and short-range/high damage grenade launcher) which together with the randomly generated terrain, slowing world-objects like water and destroyable world-objects like stones results in a pretty neat little action-game where strategy and timing is crucial to crush your opponent.</p>\n<p>This was a project I did together with some friends for a programming class in school. It was my first real project using Git and even though we used a Git-GUI, I learned pretty much about soure control.</p>"}},{"node":{"frontmatter":{"title":"Iso Conquest","tech":["JavaScript","CSS","HTML"],"github":"https://github.com/Greenheart/iso-conquest","demo":"https://samuelplumppu.se/iso-conquest","year":"2016 - 2018"},"html":"<p>In this minimalistic, turn based strategy game, your task is to seize control over the battlefield. It features gamemodes for PvP as well as experimental Player vs AI.</p>\n<p>The technology behind this project makes heavy use of new features of the web platform. For example, I experimented with advanced CSS Transforms to achieve the isometric UI. I also used native CSS variables, something that greatly increases the usability of vanilla CSS. And of course, I used modern JavaScript.</p>\n<p>Initially, this project was about creating a game with a nice UI and UX. But as things progressed, this turned out to be a great playing ground for learning about artificial intelligence.</p>\n<p><a href=\"https://samuelplumppu.se/iso-conquest\">Play the latest version!</a></p>"}},{"node":{"frontmatter":{"title":"Tab Typer","tech":["JavaScript","localForage.js","FileSaver.js","CSS","HTML"],"github":"https://github.com/Greenheart/tab-typer","demo":"https://samuelplumppu.se/tab-typer","year":"2018"},"html":"<p>As the web platform matures and standardize over time, it's interesting to see what can be done without common libraries or frameworks. Even though modern tooling provides good structure and solutions for larger projects, they all rely on the fundamental web platform features.</p>\n<p>Therefore, I like to keep up with the limits of the platform itself. It helps me better understand why the modern tools work the way they do, and what constraints they are built around.</p>\n<p>Designed and implemented in a few days, this project was created so I could edit temporary notes in a focused environment, without leaving the browser. It's pretty convenient to just open a new tab and start typing in less than three seconds.</p>\n<p><a href=\"https://samuelplumppu.se/tab-typer\">Try it in your next tab!</a></p>"}},{"node":{"frontmatter":{"title":"Prime or Not?","tech":["JavaScript","CSS","HTML"],"github":"https://github.com/Greenheart/numbers","demo":"https://samuelplumppu.se/numbers","year":"2017"},"html":"<p>Starting as a joke about how it would be to learn prime numbers in an app with a two button interface similar to Tinder, this idea turned into an actual prototype.</p>\n<p>To work on older phones, I only used well supported web technologies. Of course, a proper build tool setup with transpiling, polyfills and vendor-prefixing is ideal for a serious project where you want to use new, improved web platform features. But skipping all distractions allowed me to focus on core features and create most of this prototype in an evening. Then I could get almost instant user feedback.</p>\n<p>Even though I put some thought into the UX and designed the UI on paper before I wrote any code, this prototype has some issues that would be fixed in a full version. But after all, this was a really fun design project, thanks to the fast release and iteration. I'm especially happy with the UI design for the bottom section.</p>\n<p><a href=\"https://samuelplumppu.se/numbers\">Do you know your primes?</a></p>"}},{"node":{"frontmatter":{"title":"The Responsible","tech":["JavaScript","CSS","HTML"],"github":"https://github.com/Greenheart/text-game","demo":"https://samuelplumppu.se/text-game","year":"2018"},"html":"<p>At one point, I wanted to be an author. At another, I wanted to be a developer. So I figured, why not just do both?</p>\n<p>This is an exploration of interactive storytelling. How to make characters and environments come alive, without using much more than a vivid language. Instead of fancy graphics, this game uses one of the best rendering engines available; the human imagination.</p>\n<p>Since this game is built from the ground up, it's also a game engine. Several parts of this project could theoretically be reused for another text game with a completely different setting and story. This was not intentional during development, but rather a consequence of how the (at the time) most sane design choices ended up creating a modular project, where the content itself can be replaced.</p>\n<p>Another fun part of this project is that ideas, planning and progress all were tracked in Git, making it easy to see design thoughts at a given time.</p>\n<p><a href=\"https://samuelplumppu.se/text-game\">Experience the first chapter of the story</a></p>"}},{"node":{"frontmatter":{"title":"The not so Busy Business","tech":["Python"],"github":"https://github.com/Greenheart/cars_game","demo":null,"year":"2014"},"html":"<p>A challenging text strategy game about a taxi/delivery-service. Including features like highscores, car-upgrades and character development. Really fun to create and loads of good practice to get fundamental programming concepts in place.</p>\n<p>My biggest challenge with this project was to format the text-interface to fit the console. Especially the highscores were tricky. This was my last serious project built without a version control system as I realized it was hard to keep track of changes in a file 1000+ lines long. This project also taught me why modular code beat long functions that does multiple things... ☺</p>"}},{"node":{"frontmatter":{"title":"Goa Space Survival","tech":["JavaScript","Meteor","Phaser","Mongo DB"],"github":"https://github.com/Greenheart/goa-space-survival","demo":null,"year":"2015"},"html":"<p>A space-survival game created with Phaser as the game engine and Meteor for the real-time highscores. My main goal with this game was to spend a weekend to create a simple game with Phaser and then publish it to my friends. Since the development went so smooth, I decided to also implement the highscores to make the game more interesting.</p>\n<p>This project taught me about publishing apps and gave me insights to some of the security issues that arises if you trust clients too much. Knowledge like this will be useful in the future!</p>\n<p>A final warning: The simplistic gameplay proved to be quite addictive, so be careful if you try it... ☺</p>"}}]},"Tiomila2015":{"childImageSharp":{"fluid":{"base64":"data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAANABQDASIAAhEBAxEB/8QAFwABAQEBAAAAAAAAAAAAAAAAAAQBBf/EABcBAAMBAAAAAAAAAAAAAAAAAAABAgP/2gAMAwEAAhADEAAAAY8nXne5IX//xAAaEAEAAwADAAAAAAAAAAAAAAACAAERAxIh/9oACAEBAAEFAuKuxSyE6S8l+y5//8QAFxEAAwEAAAAAAAAAAAAAAAAAAAETMf/aAAgBAwEBPwGa0mj/xAAWEQADAAAAAAAAAAAAAAAAAAAAARL/2gAIAQIBAT8Btls//8QAFhABAQEAAAAAAAAAAAAAAAAAARAg/9oACAEBAAY/AiDj/8QAGxAAAwADAQEAAAAAAAAAAAAAAAERITFBUZH/2gAIAQEAAT8hZAjMgn3F0bGNazB93fokfT//2gAMAwEAAgADAAAAEJA//8QAFhEBAQEAAAAAAAAAAAAAAAAAAQAR/9oACAEDAQE/EAXUx//EABYRAQEBAAAAAAAAAAAAAAAAABEBEP/aAAgBAgEBPxB4Yf/EABwQAQADAAIDAAAAAAAAAAAAAAEAESFBYVGRof/aAAgBAQABPxBSRQpDqKSQoxTVl0jHUC9zlPxKnqHisq7aAofU/9k=","aspectRatio":1.5491679273827534,"src":"/static/a474daf785cfb3d5029bd2556dc5bf26/6a8a9/Tiomila2015.jpg","srcSet":"/static/a474daf785cfb3d5029bd2556dc5bf26/9e575/Tiomila2015.jpg 500w,\n/static/a474daf785cfb3d5029bd2556dc5bf26/79449/Tiomila2015.jpg 1000w,\n/static/a474daf785cfb3d5029bd2556dc5bf26/6a8a9/Tiomila2015.jpg 1024w","srcWebp":"/static/a474daf785cfb3d5029bd2556dc5bf26/0c2e2/Tiomila2015.webp","srcSetWebp":"/static/a474daf785cfb3d5029bd2556dc5bf26/7fe04/Tiomila2015.webp 500w,\n/static/a474daf785cfb3d5029bd2556dc5bf26/d619e/Tiomila2015.webp 1000w,\n/static/a474daf785cfb3d5029bd2556dc5bf26/0c2e2/Tiomila2015.webp 1024w","sizes":"(max-width: 1024px) 100vw, 1024px"}}}}}